<?php

declare(strict_types=1);

return [
    /*
    |--------------------------------------------------------------------------
    | Table Columns
    |--------------------------------------------------------------------------
    */

    'column.name' => 'العنوان',
    'column.guard_name' => 'اسم الحارس',
    'column.roles' => 'الأدوار',
    'column.permissions' => 'الصلاحيات',
    'column.updated_at' => 'تاريخ التحديث',

    /*
    |--------------------------------------------------------------------------
    | Form Fields
    |--------------------------------------------------------------------------
    */

    'field.name' => 'العنوان',
    'field.guard_name' => 'اسم الحارس',
    'field.permissions' => 'الصلاحيات',
    'field.select_all.name' => 'تحديد الكل',
    'field.select_all.message' => 'تفعيل كافة الصلاحيات لهذا الدور',

    /*
    |--------------------------------------------------------------------------
    | Navigation & Resource
    |--------------------------------------------------------------------------
    */

    'nav.group' => 'إدارة الوصول',
    'nav.role.label' => 'الأدوار',
    'nav.role.icon' => 'heroicon-o-shield-check',
    'resource.label.role' => 'دور',
    'resource.label.roles' => 'الأدوار',

    /*
    |--------------------------------------------------------------------------
    | Section & Tabs
    |--------------------------------------------------------------------------
    */

    'section' => 'الأقسام',
    'resources' => 'المصادر',
    'widgets' => 'الأجزاء',
    'pages' => 'الصفحات',
    'custom' => 'صلاحيات مخصصة',

    /*
    |--------------------------------------------------------------------------
    | Messages
    |--------------------------------------------------------------------------
    */

    'forbidden' => 'أنت غير مخول، لديك صلاحية للوصول',

    /*
    |--------------------------------------------------------------------------
    | Resource Permissions' Labels
    |--------------------------------------------------------------------------
    */

    'resource_permission_prefixes_labels' => [
        'view' => 'عرض',
        'view_any' => 'عرض الكل',
        'create' => 'إضافة',
        'update' => 'تعديل',
        'delete' => 'حذف',
        'delete_any' => 'حذف الكل',
        'force_delete' => 'إجبار الحذف',
        'force_delete_any' => ' إجبار حذف أي',
        'reorder' => 'إعادة ترتيب',
        'restore' => 'استرجاع',
        'restore_any' => 'استرجاع الكل',
        'replicate' => 'استنساخ',
        'reset_password' => 'إعادة تعيين كلمة المرور',
        'accept' => 'قبول',
        'cancel_accept' => 'إلغاء القبول',
        'pay' => 'تسديد',
        'cancel_payment'=> 'إلغاء السداد',
        'print_receipt'=> 'طباعة حافظة',
        'confirm' => 'تأكيد',
        'cancel_confirm' => 'إلغاء التأكيد',
        'update_from_ministry_applicant' => 'تحديث من الوزارة',
        'show_clearing_attachments' => 'عرض ملفات المقاصاة',
        "complete_file" => "إكمال الملف وإصدار الحافظة",
        'approve' => 'مراجعة',
        'first_review' => 'المراجعة الأولى',
        'second_review' => 'المراجعة الثانية',
        're_review_first' => 'إعادة المراجعة الأولى',
        're_review_second' => 'إعادة المراجعة الثانية',
        'rereview_first' => 'إعادة المراجعة الأولى',
        'rereview_second' => 'إعادة المراجعة الثانية',
        'show_with_certificate' => 'استعراض الشهادة الثانوية',
        'update_university_settings' => 'تغيير إعدادات الجامعة',
        'convert_to_clearing' => 'تحويل إلى طالب مقاصاة',
        'convert_to_applicant' => 'تحويل إلى طالب اعتيادي',
    ],
];
